** Zugriffe auf Zeichenketten
   Wir können ähnlich zu arrays auch Teile von Zeichenketten ansprechen:
  #+BEGIN_SRC f90 :export both :results output
    PROGRAM character_example
      IMPLICIT NONE

      CHARACTER(LEN=5) :: mytext = "Text1"

      ! Nun kann ich Teile meiner Zeichenkette mytext ansprechen, wie bei
      ! einem array

      write (*,*) mytext(3:)
      write (*,*) mytext(:3)
      write (*,*) mytext(2:4)


      ! Ein einzelnen Eintrag ist jedoch nicht möglich (im Gegensatz zu
      ! arrays). Das heißt die folgende Zeile wirft einen Fehler währen
      ! dem Compilierungsvorgang
      ! write (*,*) mytext(3)

      ! Zeichenketten können auch konkateniert werden mit //

      write (*,*) mytext // mytext
      write (*,*) mytext(1:3) // mytext(3:)
      write (*,*) mytext // "und das ist ganz anderer Text"

    END PROGRAM character_example
  #+END_SRC

  #+RESULTS:
  : xt1
  : Tex
  : ext
  : Text1Text1
  : Texxt1
  : Text1und das ist ganz anderer Text

** Es gibt keine ~CHARACTER~ beliebiger Größe
   Wir können die Länge ~LEN=*~ angeben um einer Zeichenkette eine beliebige Größe zu geben, jedoch wird diese Größe bei
   der ersten Zuweisung fest gelegt.
   #+BEGIN_SRC f90 :export both :results output
     PROGRAM arbitrariy_character
       IMPLICIT NONE

       CHARACTER(LEN=*), parameter :: arbitrary_len = "Eine Zeichenketten unbekannter Größe"

       write (*,*) arbitrary_len

     END PROGRAM arbitrariy_character
   #+END_SRC

   #+RESULTS:
   : Eine Zeichenketten unbekannter Größe

** Bsp. von [[https://srv.rz.uni-bayreuth.de/lehre/fortran90/vorlesung/][dieser Quelle]].
   #+BEGIN_SRC fortran :export both :results output
     !    Beispiele Formatbeschreiber REAL
				   !
				   ! a) rFw.d Fixpunktdarstellung
				   ! b) rEw.d wissenschaftliche Darstellung
				   ! c) rESw .d " echte " wissenschaftliche Darstellung ( Fortran90 /95 Erweiterung )
				   ! d) rENw .d " Ingenieur - Darstellung " ( Fortran90 /95 Erweiterung )
				   ! e) rGw.d " Gleitpunktzahl " je nachdem F oder E- Format
				   !
				   ! r : Wiederholungsfaktor
				   ! w : Feldgroesse
				   ! d : Nachkommastellen : dabei muss gelten :
				   !
				   ! a) w >= d+2
				   ! b) w >= d+7 falls der Compiler die Null vor
				   ! dem Punkt schreibt . Falls der Compiler
				   ! die Ziffer 0 nicht ausschreibt , reicht w >= d+6
				   ! c) w >= d+7 aehnlich b) , die Ziffer vor dem Punkt
				   ! liegt zwischen -9 und 9
				   ! d) w >= d+9 aehnlich b) und c) , die Zahl vor dem Punkt liegt zwischen
				   ! 1 und 999 bzw. -1 und -999 und die Exponent zur Basis 10
				   ! wird stets als ein Vielfaches von 3 bzw. -3 dargestellt
				   ! wie es den ueblichen Benennungen als Kilo , Mega , Giga ...
				   ! bzw. Milli , Mikro , Nano ... entspricht
				   !
				   ! e) w >= d+7 Falls sich die Zahl als Fixpunktzahl (F- Format )
				   ! darstellen laesst , wird dieses verwendet , wenn nicht ,
				   ! wird die E - Darstellung eingesetzt )
				   !
      program format_real

      implicit none
      real :: x = 1.234567 , y = 2.222222E5 , z = -3.3333E-5

      write (* ,*) ' Listengesteuerte Ausgabe einzeln :'
      write (* ,*) x
      write (* ,*) y
      write (* ,*) z
      write (* ,*)

      write (* ,*) ' Formatgesteuerte Ausgabe ''(F13 .4) '':'
      100 format (1X,F13 .4)
      write (* ,100) x
      write (* ,100) y
      write (* ,100) z
      write (* ,*)

      write (* ,*) ' Formatgesteuerte Ausgabe ''(E13 .4) '':'
      200 format (1X,E13 .4)
      write (* ,200) x
      write (* ,200) y
      write (* ,200) z
      write (* ,*)

      write (* ,*) ' Formatgesteuerte Ausgabe ''( ES13 .4) '':'
      300 format (1X, ES13 .4)


      write (* ,300) x
      write (* ,300) y
      write (* ,300) z
      write (* ,*)

      write (* ,*) ' Formatgesteuerte Ausgabe ''( EN13 .4) '':'
      400 format (1X, EN13 .4)
      write (* ,400) x
      write (* ,400) y
      write (* ,400) z
      write (* ,*)

      write (* ,*) ' Formatgesteuerte Ausgabe ''(G13 .4) '':'
     500 format (1X,G13 .4)
      write (* ,500) x
      write (* ,500) y
      write (* ,500) z

     END PROGRAM format_real
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Listengesteuerte Ausgabe einzeln :
    1.23456705    
    222222.203    
   -3.33329990E-05

   Formatgesteuerte Ausgabe '(F13 .4) ':
	 1.2346
    222222.2031
	-0.0000

   Formatgesteuerte Ausgabe '(E13 .4) ':
     0.1235E+01
     0.2222E+06
    -0.3333E-04

   Formatgesteuerte Ausgabe '( ES13 .4) ':
     1.2346E+00
     2.2222E+05
    -3.3333E-05

   Formatgesteuerte Ausgabe '( EN13 .4) ':
     1.2346E+00
   222.2222E+03
   -33.3330E-06

   Formatgesteuerte Ausgabe '(G13 .4) ':
      1.235    
     0.2222E+06
    -0.3333E-04
   #+end_example
